

: NOTE: =:eval= (or ~:eval~?) header docs: https://orgmode.org/manual/Evaluating-Code-Blocks.html

: NOTE: consider making :results verbatim part of defaults


Ensure Emacs can run the shell snippets from this document:
#+begin_src emacs-lisp :results silent
  (customize-set-variable 'org-babel-load-languages '((shell . t)))
#+end_src
(Addresses errors like =No org-babel-execute function for sh!=)

: #  - * -  org-babel-default-header-args: ((:exports . "both") (:eval . "never-export"))  - * -


#+begin_example sh
  export PATH="$(brew --prefix node@12)"/bin:"$PATH"
#+end_example

#+begin_example sh
  export HOME="$(mktemp -d)"
  npm config set prefix '~/.local'
  export PATH="$HOME/.local/bin:$PATH"
  npm install --global @refactr/cli
#+end_example

(The =|| true= in the following is because ~refactrctl~ has an exit code of 1 with no arguments)
#+begin_src sh
  refactrctl || true
#+end_src

#+RESULTS:
#+begin_example
Usage: refactrctl [options] [command]

Options:
  -V, --version           output the version number
  --access-token <token>  API token
  --api-url <url>         API endpoint (default: "https://api.refactr.it/v1")
  -h, --help              display help for command

Commands:
  job [options]           Commands to view and modify jobs.
  project                 Commands to view and modify projects.
  help [command]          display help for command
#+end_example

#+begin_src sh
  refactrctl --help
#+end_src

#+RESULTS:
#+begin_example
Usage: refactrctl [options] [command]

Options:
  -V, --version           output the version number
  --access-token <token>  API token
  --api-url <url>         API endpoint (default: "https://api.refactr.it/v1")
  -h, --help              display help for command

Commands:
  job [options]           Commands to view and modify jobs.
  project                 Commands to view and modify projects.
  help [command]          display help for command
#+end_example

#+begin_src sh
  refactrctl -h
#+end_src

#+RESULTS:
#+begin_example
Usage: refactrctl [options] [command]

Options:
  -V, --version           output the version number
  --access-token <token>  API token
  --api-url <url>         API endpoint (default: "https://api.refactr.it/v1")
  -h, --help              display help for command

Commands:
  job [options]           Commands to view and modify jobs.
  project                 Commands to view and modify projects.
  help [command]          display help for command
#+end_example

#+begin_src sh
  refactrctl -V
#+end_src

#+RESULTS:
: 0.12.1

#+begin_src sh
  refactrctl --version
#+end_src

#+RESULTS:
: 0.12.1

#+begin_src sh
  refactrctl help
#+end_src

#+RESULTS:
#+begin_example
Usage: refactrctl [options] [command]

Options:
  -V, --version           output the version number
  --access-token <token>  API token
  --api-url <url>         API endpoint (default: "https://api.refactr.it/v1")
  -h, --help              display help for command

Commands:
  job [options]           Commands to view and modify jobs.
  project                 Commands to view and modify projects.
  help [command]          display help for command
#+end_example

#+begin_src sh
  REFACTR_AUTH_TOKEN="$OB_REFACTR_ACCESS_TOKEN" refactrctl help
#+end_src

#+RESULTS:
#+begin_example
Usage: refactrctl [options] [command]

Options:
  -V, --version           output the version number
  --access-token <token>  API token
  --api-url <url>         API endpoint (default: "https://api.refactr.it/v1")
  -h, --help              display help for command

Commands:
  job [options]           Commands to view and modify jobs.
  project                 Commands to view and modify projects.
  help [command]          display help for command
#+end_example

#+begin_src sh
  refactrctl project list 2>&1
  true
#+end_src

#+RESULTS:
: Auth token is required.

NOTE: try viewing the following with less --RAW-CONTROL-CHARS

#+begin_src sh
  REFACTR_AUTH_TOKEN="$OB_REFACTR_ACCESS_TOKEN" refactrctl project list
#+end_src

#+RESULTS:
#+begin_example
â”Œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¬â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¬â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”
[37mâ”‚[0m[37m [0m[01m                      id[0m[37m â”‚[0m[37m [0m[01m                                                                   name[0m[37m â”‚[0m[37m [0m[01m         organization_id[0m[37m â”‚[0m
â”œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¤
[37mâ”‚[0m[37m [0m[37m5f4d4b1b853181b41e8b0b12[0m[37m â”‚[0m[37m [0m[37m                                                     Culpepper's Corner[0m[37m â”‚[0m[37m [0m[37m5db4b34a5155b30036b6c52e[0m[37m â”‚[0m
[37mâ”‚[0m[37m [0m[37m5db96e5569889400360bb6c2[0m[37m â”‚[0m[37m [0m[37m                                                     Refactr Publishing[0m[37m â”‚[0m[37m [0m[37m5db4b34a5155b30036b6c52e[0m[37m â”‚[0m
[37mâ”‚[0m[37m [0m[37m5ee400ee6a31cf8bd75eef73[0m[37m â”‚[0m[37m [0m[37m                                                       Speelman Sandbox[0m[37m â”‚[0m[37m [0m[37m5db4b34a5155b30036b6c52e[0m[37m â”‚[0m
[37mâ”‚[0m[37m [0m[37m5ef3e3eafb48500826c19229[0m[37m â”‚[0m[37m [0m[37m                                                            Sales Demos[0m[37m â”‚[0m[37m [0m[37m5db4b34a5155b30036b6c52e[0m[37m â”‚[0m
[37mâ”‚[0m[37m [0m[37m5dbb31f4e898eb0036771efd[0m[37m â”‚[0m[37m [0m[37m                                                      Scratch / Testing[0m[37m â”‚[0m[37m [0m[37m5db4b34a5155b30036b6c52e[0m[37m â”‚[0m
[37mâ”‚[0m[37m [0m[37m5fa4b77cc1cc201246a7cb2b[0m[37m â”‚[0m[37m [0m[37m                                            Speelman Self-Hosted Runner[0m[37m â”‚[0m[37m [0m[37m5db4b34a5155b30036b6c52e[0m[37m â”‚[0m
[37mâ”‚[0m[37m [0m[37m5f6e5fbac0dfa832219c334e[0m[37m â”‚[0m[37m [0m[37m                                                            Screenshots[0m[37m â”‚[0m[37m [0m[37m5db4b34a5155b30036b6c52e[0m[37m â”‚[0m
[37mâ”‚[0m[37m [0m[37m5eff6cd7ae909b0ff2bb651c[0m[37m â”‚[0m[37m [0m[37m                                                           Fortinet PoC[0m[37m â”‚[0m[37m [0m[37m5db4b34a5155b30036b6c52e[0m[37m â”‚[0m
[37mâ”‚[0m[37m [0m[37m5ef02894a6c1bb4d4b88240b[0m[37m â”‚[0m[37m [0m[37m[Deprecated] Checkmarx PoC (See Checkmarx Organization for new Project)[0m[37m â”‚[0m[37m [0m[37m5db4b34a5155b30036b6c52e[0m[37m â”‚[0m
[37mâ”‚[0m[37m [0m[37m5e3914daa8f4de004023df87[0m[37m â”‚[0m[37m [0m[37m                                              Air Force LevelUp Project[0m[37m â”‚[0m[37m [0m[37m5db4b34a5155b30036b6c52e[0m[37m â”‚[0m
â””â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”´â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”´â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”˜
#+end_example

#+begin_src sh
  REFACTR_AUTH_TOKEN=bad-but-overridden-token refactrctl --access-token="$OB_REFACTR_ACCESS_TOKEN" project list
#+end_src

#+RESULTS:
#+begin_example
â”Œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¬â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¬â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”
[37mâ”‚[0m[37m [0m[01m                      id[0m[37m â”‚[0m[37m [0m[01m                                                                   name[0m[37m â”‚[0m[37m [0m[01m         organization_id[0m[37m â”‚[0m
â”œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¤
[37mâ”‚[0m[37m [0m[37m5fb1fd0e4245df0c4b60fef9[0m[37m â”‚[0m[37m [0m[37m                                                   Josh's first project[0m[37m â”‚[0m[37m [0m[37m5db4b34a5155b30036b6c52e[0m[37m â”‚[0m
[37mâ”‚[0m[37m [0m[37m5f4d4b1b853181b41e8b0b12[0m[37m â”‚[0m[37m [0m[37m                                                     Culpepper's Corner[0m[37m â”‚[0m[37m [0m[37m5db4b34a5155b30036b6c52e[0m[37m â”‚[0m
[37mâ”‚[0m[37m [0m[37m5db96e5569889400360bb6c2[0m[37m â”‚[0m[37m [0m[37m                                                     Refactr Publishing[0m[37m â”‚[0m[37m [0m[37m5db4b34a5155b30036b6c52e[0m[37m â”‚[0m
[37mâ”‚[0m[37m [0m[37m5ee400ee6a31cf8bd75eef73[0m[37m â”‚[0m[37m [0m[37m                                                       Speelman Sandbox[0m[37m â”‚[0m[37m [0m[37m5db4b34a5155b30036b6c52e[0m[37m â”‚[0m
[37mâ”‚[0m[37m [0m[37m5ef3e3eafb48500826c19229[0m[37m â”‚[0m[37m [0m[37m                                                            Sales Demos[0m[37m â”‚[0m[37m [0m[37m5db4b34a5155b30036b6c52e[0m[37m â”‚[0m
[37mâ”‚[0m[37m [0m[37m5dbb31f4e898eb0036771efd[0m[37m â”‚[0m[37m [0m[37m                                                      Scratch / Testing[0m[37m â”‚[0m[37m [0m[37m5db4b34a5155b30036b6c52e[0m[37m â”‚[0m
[37mâ”‚[0m[37m [0m[37m5fa4b77cc1cc201246a7cb2b[0m[37m â”‚[0m[37m [0m[37m                                            Speelman Self-Hosted Runner[0m[37m â”‚[0m[37m [0m[37m5db4b34a5155b30036b6c52e[0m[37m â”‚[0m
[37mâ”‚[0m[37m [0m[37m5f6e5fbac0dfa832219c334e[0m[37m â”‚[0m[37m [0m[37m                                                            Screenshots[0m[37m â”‚[0m[37m [0m[37m5db4b34a5155b30036b6c52e[0m[37m â”‚[0m
[37mâ”‚[0m[37m [0m[37m5eff6cd7ae909b0ff2bb651c[0m[37m â”‚[0m[37m [0m[37m                                                           Fortinet PoC[0m[37m â”‚[0m[37m [0m[37m5db4b34a5155b30036b6c52e[0m[37m â”‚[0m
[37mâ”‚[0m[37m [0m[37m5ef02894a6c1bb4d4b88240b[0m[37m â”‚[0m[37m [0m[37m[Deprecated] Checkmarx PoC (See Checkmarx Organization for new Project)[0m[37m â”‚[0m[37m [0m[37m5db4b34a5155b30036b6c52e[0m[37m â”‚[0m
â””â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”´â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”´â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”˜
#+end_example

#+begin_src sh
  refactrctl job list --project=5fb1fd0e4245df0c4b60fef9 --access-token=$OB_REFACTR_ACCESS_TOKEN
#+end_src

#+RESULTS:
: â”
: [37mâ”‚[0m
: â”¤
: â”˜

#+begin_src sh
  refactrctl job list --access-token $OB_REFACTR_ACCESS_TOKEN --project 5f4d4b1b853181b41e8b0b12
#+end_src

#+RESULTS:
: â”Œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¬â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”
: [37mâ”‚[0m[37m [0m[01m                      id[0m[37m â”‚[0m[37m [0m[01m                            name[0m[37m â”‚[0m
: â”œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¤
: [37mâ”‚[0m[37m [0m[37m5f99dc8ef9c74e806d6110f6[0m[37m â”‚[0m[37m [0m[37mRunner Environment Variables Job[0m[37m â”‚[0m
: â””â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”´â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”˜

#+begin_src sh
  refactrctl job list --access-token="$OB_REFACTR_ACCESS_TOKEN" --project=5fb1fd0e4245df0c4b60fef9
#+end_src

#+RESULTS:
: â”Œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¬â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”
: [37mâ”‚[0m[37m [0m[01m                      id[0m[37m â”‚[0m[37m [0m[01m            name[0m[37m â”‚[0m
: â”œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¤
: [37mâ”‚[0m[37m [0m[37m5fb1ffa48c1df74718433d15[0m[37m â”‚[0m[37m [0m[37mJosh's first job[0m[37m â”‚[0m
: â””â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”´â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”˜

TODO: verify that the organization-id works for project listing

: # org-babel-default-header-args: ((:session . "refactr-cli") (:results . "output verbatim replace"))

# Local Variables:
# org-confirm-babel-evaluate: nil
# org-babel-default-header-args: ((:results . "verbatim replace"))
# End:
